# 任务是这样的 ：麻烦将图表中营业部客户资产流失和周转率太低的客户所对应的客户经理或者理财顾问找出来。

def select(path = r'E:\Work\CFZZ\Data\PreData2', data = '201701-201705新增.csv', ):
    os.chdir(path)
    df = pd.read_csv(data)
    df0 = df[(df['经营单元'] == '长沙八一路(单元)') | (df['经营单元'] == '长沙芙蓉中路(单元)') 
   | (df['经营单元'] == '太原营业部(单元)') | (df['经营单元'] == '沈阳北陵大街(单元)') 
   | (df['经营单元'] == '哈尔滨营业部(单元)') | (df['经营单元'] == '贵阳营业部(单元)')
   | (df['经营单元'] == '昆明营业部(单元)') | (df['经营单元'] == '兰州营业部(单元)')
   | (df['经营单元'] == '广州营业部(单元)') | (df['经营单元'] == '重庆营业部(单元)')]
    name = '筛选营业部_' + data
    df0.to_csv(name, index = None)